ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
#if !defined(RCC_ICSCR1_MSIBIAS_CONTINUOUS) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIBIAS_CONTINUOUS not defined"
#endif
#if !defined(RCC_ICSCR1_MSIBIAS_SAMPLING) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIBIAS_SAMPLING not defined"
#endif
#if !((STM32_CFG_MSIBIAS == RCC_ICSCR1_MSIBIAS_CONTINUOUS) ||               \
     (STM32_CFG_MSIBIAS == RCC_ICSCR1_MSIBIAS_SAMPLING)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MSIBIAS value specified"
#endif

/**
 * @brief   NONE clock derived enable state.
 */
#define STM32_NONE_ENABLED                  FALSE

/**
 * @brief   HSI16 clock derived enable state.
 */
#define STM32_HSI16_ENABLED                 STM32_CFG_HSI16_ENABLE

/**
 * @brief   HSI48 clock derived enable state.
 */
#define STM32_HSI48_ENABLED                 STM32_CFG_HSI48_ENABLE

/**
 * @brief   HSE clock derived enable state.
 */
#define STM32_HSE_ENABLED                   STM32_CFG_HSE_ENABLE

/**
 * @brief   LSE clock derived enable state.
 */
#define STM32_LSE_ENABLED                   STM32_CFG_LSE_ENABLE

/**
 * @brief   LSI clock derived enable state.
 */
#define STM32_LSI_ENABLED                   STM32_CFG_LSI_ENABLE

/**
 * @brief   MSIRC0 clock derived enable state.
 */
#define STM32_MSIRC0_ENABLED                (((STM32_MSIS_ENABLED == TRUE) && \
                                              ((STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC0_DIV1) || \
                                               (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC0_DIV2) || \
                                               (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC0_DIV4) || \
                                               (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC0_DIV8))) || \
                                             ((STM32_MSIK_ENABLED == TRUE) && \
                                              ((STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV1) || \
                                               (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV2) || \
                                               (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV4) || \
                                               (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV8))))

/**
 * @brief   MSIRC1 clock derived enable state.
 */
#define STM32_MSIRC1_ENABLED                (((STM32_MSIS_ENABLED == TRUE) && \
                                              ((STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC1_DIV1) || \
                                               (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC1_DIV2) || \
                                               (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC1_DIV4) || \
                                               (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC1_DIV8))) || \
                                             ((STM32_MSIK_ENABLED == TRUE) && \
                                              ((STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1) || \
                                               (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2) || \
                                               (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4) || \
                                               (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV8))))

/**
 * @brief   MSIS clock derived enable state.
 */
#define STM32_MSIS_ENABLED                  (((STM32_SYSCLK_ENABLED == TRUE) && \
                                              (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_MSIS)) || \
                                             ((STM32_MCO1DIV_ENABLED == TRUE) && \
                                              (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_MSIS)) || \
                                             ((STM32_MCO2DIV_ENABLED == TRUE) && \
                                              (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_MSIS)))

/**
 * @brief   MSIK clock derived enable state.
 */
#define STM32_MSIK_ENABLED                  (((STM32_MCO1DIV_ENABLED == TRUE) && \
                                              (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_MSIK)) || \
                                             ((STM32_MCO2DIV_ENABLED == TRUE) && \
                                              (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_MSIK)))

/**
 * @brief   SYSCLK clock derived enable state.
 */
#define STM32_SYSCLK_ENABLED                TRUE

/**
 * @brief   HCLK clock derived enable state.
 */
#define STM32_HCLK_ENABLED                  TRUE

/**
 * @brief   PCLK1 clock derived enable state.
 */
#define STM32_PCLK1_ENABLED                 TRUE

/**
 * @brief   PCLK1TIM clock derived enable state.
 */
#define STM32_PCLK1TIM_ENABLED              TRUE

/**
 * @brief   PCLK2 clock derived enable state.
 */
#define STM32_PCLK2_ENABLED                 TRUE

/**
 * @brief   PCLK2TIM clock derived enable state.
 */
#define STM32_PCLK2TIM_ENABLED              TRUE

/**
 * @brief   PCLK3 clock derived enable state.
 */
#define STM32_PCLK3_ENABLED                 TRUE

/**
 * @brief   MCO1DIV clock derived enable state.
 */
#define STM32_MCO1DIV_ENABLED               TRUE

/**
 * @brief   MCO1 clock derived enable state.
 */
#define STM32_MCO1_ENABLED                  TRUE

/**
 * @brief   MCO2DIV clock derived enable state.
 */
#define STM32_MCO2DIV_ENABLED               TRUE

/**
 * @brief   MCO2 clock derived enable state.
 */
#define STM32_MCO2_ENABLED                  TRUE

/*--- Macros and checks for the NONE clock point. --------------------------*/

/**
 * @brief   NONE clock register bits.
 */
#if (STM32_NONE_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_NONE_BITS                   0U
#else
  #define STM32_NONE_BITS                   0U
#endif

/**
 * @brief   Pseudo-clock for disabled sources clock point.
 */
#if (STM32_NONE_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_NONE_FREQ                   0U
#else
  #define STM32_NONE_FREQ                   0U
#endif

/*--- Macros and checks for the HSI16 clock point. -------------------------*/

