ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
#if !((STM32_CFG_HSI16_ENABLE == TRUE) || (STM32_CFG_HSI16_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_HSI16_ENABLE value specified"
#endif

#if !defined(RCC_CFGR1_SW_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_SW_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_SYSCLK_ENABLED == TRUE) &&  \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by SYSCLK"
#endif

#if !defined(RCC_CFGR1_MCO1SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_MCO1SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_MCO1DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_HSI16))) &&               \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by MCO1DIV"
#endif

#if !defined(RCC_CFGR1_MCO2SEL_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_MCO2SEL_HSI16 not defined"
#endif
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_MCO2DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_HSI16))) &&               \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by MCO2DIV"
#endif

/**
 * @brief   HSI16 clock register bits.
 */
#if (STM32_HSI16_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSI16_BITS                  (RCC_CR_HSION | RCC_CR_HSIKERON)
#else
  #define STM32_HSI16_BITS                  0U
#endif

/**
 * @brief   16MHz high speed internal oscillator clock point.
 */
#if (STM32_HSI16_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSI16_FREQ                  16000000U
#else
  #define STM32_HSI16_FREQ                  0U
#endif

/*--- Macros and checks for the HSI48 clock point. -------------------------*/

#if !((STM32_CFG_HSI48_ENABLE == TRUE) || (STM32_CFG_HSI48_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_HSI48_ENABLE value specified"
#endif

#if !defined(RCC_CFGR1_MCO1SEL_HSI48) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_MCO1SEL_HSI48 not defined"
#endif
#if !((STM32_HSI48_ENABLED == TRUE) || !((STM32_MCO1DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_HSI48))) &&               \
    !defined(__DOXYGEN__)
  #error "HSI48 not enabled, required by MCO1DIV"
#endif

#if !defined(RCC_CFGR1_MCO2SEL_HSI48) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_MCO2SEL_HSI48 not defined"
#endif
#if !((STM32_HSI48_ENABLED == TRUE) || !((STM32_MCO2DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_HSI48))) &&               \
    !defined(__DOXYGEN__)
  #error "HSI48 not enabled, required by MCO2DIV"
#endif

/**
 * @brief   HSI48 clock register bits.
 */
#if (STM32_HSI48_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSI48_BITS                  RCC_CR_HSI48ON
#else
  #define STM32_HSI48_BITS                  0U
#endif

/**
 * @brief   48MHz high speed internal oscillator clock point.
 */
#if (STM32_HSI48_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSI48_FREQ                  48000000U
#else
  #define STM32_HSI48_FREQ                  0U
#endif

/*--- Macros and checks for the HSE clock point. ---------------------------*/

#if !((STM32_CFG_HSE_ENABLE == TRUE) || (STM32_CFG_HSE_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_HSE_ENABLE value specified"
#endif

#if !defined(RCC_CFGR1_SW_HSE) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_SW_HSE not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_SYSCLK_ENABLED == TRUE) &&    \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_HSE))) && !defined(__DOXYGEN__)
  #error "HSE not enabled, required by SYSCLK"
#endif

#if !defined(RCC_CFGR1_MCO1SEL_HSE) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_MCO1SEL_HSE not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_MCO1DIV_ENABLED == TRUE) &&   \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_HSE))) && !defined(__DOXYGEN__)
  #error "HSE not enabled, required by MCO1DIV"
#endif

#if !defined(RCC_CFGR1_MCO2SEL_HSE) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_MCO2SEL_HSE not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_MCO2DIV_ENABLED == TRUE) &&   \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_HSE))) && !defined(__DOXYGEN__)
  #error "HSE not enabled, required by MCO2DIV"
#endif

/**
 * @brief   HSE clock register bits.
 */
#if (STM32_HSE_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSE_BITS                    RCC_CR_HSEON
#else
  #define STM32_HSE_BITS                    0U
#endif

/**
 * @brief   High frequency external oscillator clock point.
 */
#if (STM32_HSE_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSE_FREQ                    STM32_HSECLK
#else
  #define STM32_HSE_FREQ                    0U
#endif

/*--- Macros and checks for the LSE clock point. ---------------------------*/

#if !((STM32_CFG_LSE_ENABLE == TRUE) || (STM32_CFG_LSE_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LSE_ENABLE value specified"
#endif

#if !defined(RCC_CFGR1_MCO1SEL_LSE) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_MCO1SEL_LSE not defined"
#endif
#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_MCO1DIV_ENABLED == TRUE) &&   \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_LSE))) && !defined(__DOXYGEN__)
  #error "LSE not enabled, required by MCO1DIV"
#endif

#if !defined(RCC_CFGR1_MCO2SEL_LSE) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_MCO2SEL_LSE not defined"
#endif
#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_MCO2DIV_ENABLED == TRUE) &&   \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_LSE))) && !defined(__DOXYGEN__)
  #error "LSE not enabled, required by MCO2DIV"
#endif

/**
 * @brief   LSE clock register bits.
 */
#if (STM32_LSE_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_LSE_BITS                    RCC_BDCR_LSEON
#else
  #define STM32_LSE_BITS                    0U
#endif

/**
 * @brief   Low frequency external oscillator clock point.
 */
#if (STM32_LSE_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_LSE_FREQ                    STM32_LSECLK
#else
  #define STM32_LSE_FREQ                    0U
#endif

/*--- Macros and checks for the LSI clock point. ---------------------------*/

#if !((STM32_CFG_LSI_ENABLE == TRUE) || (STM32_CFG_LSI_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LSI_ENABLE value specified"
#endif

#if !defined(RCC_CFGR1_MCO1SEL_LSI) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_MCO1SEL_LSI not defined"
#endif
#if !((STM32_LSI_ENABLED == TRUE) || !((STM32_MCO1DIV_ENABLED == TRUE) &&   \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_LSI))) && !defined(__DOXYGEN__)
  #error "LSI not enabled, required by MCO1DIV"
#endif

#if !defined(RCC_CFGR1_MCO2SEL_LSI) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_MCO2SEL_LSI not defined"
#endif
#if !((STM32_LSI_ENABLED == TRUE) || !((STM32_MCO2DIV_ENABLED == TRUE) &&   \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_LSI))) && !defined(__DOXYGEN__)
  #error "LSI not enabled, required by MCO2DIV"
#endif

/**
 * @brief   LSI clock register bits.
 */
#if (STM32_LSI_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_LSI_BITS                    RCC_CSR_LSION
#else
  #define STM32_LSI_BITS                    0U
#endif

/**
 * @brief   Low frequency internal oscillator clock point.
 */
#if (STM32_LSI_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_LSI_FREQ                    STM32_LSICLK
#else
  #define STM32_LSI_FREQ                    0U
#endif

/*--- Macros and checks for the MSIRC0 clock point. ------------------------*/

/**
 * @brief   MSIRC0 clock register bits.
 */
#if (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE) || \
    defined(__DOXYGEN__)
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_CR_BITS            RCC_CR_MSIPLL0EN
  #else
    #define STM32_MSIRC0_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_HSE)
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_CR_BITS            RCC_CR_MSIPLL0EN
  #else
    #define STM32_MSIRC0_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE_FAST)
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_CR_BITS            (RCC_CR_MSIPLL0EN |             \
                                             RCC_CR_MSIPLL0FAST)
  #else
    #define STM32_MSIRC0_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_HSE_FAST)
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_CR_BITS            (RCC_CR_MSIPLL0EN |             \
                                             RCC_CR_MSIPLL0FAST)
  #else
    #define STM32_MSIRC0_CR_BITS            0U
  #endif
#else
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_CR_BITS            0U
  #else
    #define STM32_MSIRC0_CR_BITS            0U
  #endif
#endif

#if (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE) || \
    defined(__DOXYGEN__)
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_ICSCR1_BITS        RCC_ICSCR1_MSIPLL0SEL_LSE
  #else
    #define STM32_MSIRC0_ICSCR1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_HSE)
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_ICSCR1_BITS        (RCC_ICSCR1_MSIPLL0SEL_HSE |    \
                                             STM32_MSIHSINDIV)
  #else
    #define STM32_MSIRC0_ICSCR1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE_FAST)
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_ICSCR1_BITS        RCC_ICSCR1_MSIPLL0SEL_LSE
  #else
    #define STM32_MSIRC0_ICSCR1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_HSE_FAST)
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_ICSCR1_BITS        (RCC_ICSCR1_MSIPLL0SEL_HSE |    \
                                             STM32_MSIHSINDIV)
  #else
    #define STM32_MSIRC0_ICSCR1_BITS        0U
  #endif
#else
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_ICSCR1_BITS        0U
  #else
    #define STM32_MSIRC0_ICSCR1_BITS        0U
  #endif
#endif

/**
 * @brief   MSI 96MHz internal oscillator clock point.
 */
#if (STM32_MSIRC0_ENABLED == FALSE) && !defined(__DOXYGEN__)
  #define STM32_MSIRC0_FREQ                 0U
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE) || \
    defined(__DOXYGEN__)
  #define STM32_MSIRC0_FREQ                 96010000U
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_HSE)
  #define STM32_MSIRC0_FREQ                 96000000U
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE_FAST)
  #define STM32_MSIRC0_FREQ                 96010000U
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_HSE_FAST)
  #define STM32_MSIRC0_FREQ                 96000000U
#else
  #define STM32_MSIRC0_FREQ                 96000000U
#endif

/*--- Macros and checks for the MSIRC1 clock point. ------------------------*/

/**
 * @brief   MSIRC1 clock register bits.
 */
#if ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) && \
     ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1))) || \
    defined(__DOXYGEN__)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            RCC_CR_MSIPLL1EN
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            RCC_CR_MSIPLL1EN
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            RCC_CR_MSIPLL1EN
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            RCC_CR_MSIPLL1EN
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1))
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            RCC_CR_MSIPLL1EN
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            RCC_CR_MSIPLL1EN
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            RCC_CR_MSIPLL1EN
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            RCC_CR_MSIPLL1EN
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1))
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            (RCC_CR_MSIPLL1EN |             \
                                             RCC_CR_MSIPLL1FAST)
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            (RCC_CR_MSIPLL1EN |             \
                                             RCC_CR_MSIPLL1FAST)
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            (RCC_CR_MSIPLL1EN |             \
                                             RCC_CR_MSIPLL1FAST)
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            (RCC_CR_MSIPLL1EN |             \
                                             RCC_CR_MSIPLL1FAST)
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1))
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            (RCC_CR_MSIPLL1EN |             \
                                             RCC_CR_MSIPLL1FAST)
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            (RCC_CR_MSIPLL1EN |             \
                                             RCC_CR_MSIPLL1FAST)
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            (RCC_CR_MSIPLL1EN |             \
                                             RCC_CR_MSIPLL1FAST)
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            (RCC_CR_MSIPLL1EN |             \
                                             RCC_CR_MSIPLL1FAST)
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#else
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            0U
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#endif

