ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
/*--- Macros and checks for the MSIK clock point. --------------------------*/

/**
 * @brief   MSIK clock register bits.
 */
#if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_MSIK_CR_BITS                (RCC_CR_MSIKON | RCC_CR_MSIKERON)
#else
  #define STM32_MSIK_CR_BITS                0U
#endif

#if ((STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV1) && \
     ((STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE) || (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE_FAST))) || \
    defined(__DOXYGEN__)
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC0 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(0U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV1)
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC0 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(0U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV2) && \
      ((STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE) || (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC0 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(1U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV2)
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC0 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(1U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV4) && \
      ((STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE) || (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC0 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(2U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV4)
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC0 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(2U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV8) && \
      ((STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE) || (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC0 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(3U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV8)
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC0 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(3U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1)) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(0U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1)) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(0U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(0U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(0U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(0U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(0U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1)
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(0U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1)) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(1U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1)) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(1U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(1U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(1U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(1U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(1U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2)
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(1U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1)) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(2U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1)) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(2U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(2U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(2U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(2U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(2U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4)
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(2U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV8) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1)) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(3U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV8) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1)) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(3U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV8) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(3U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV8) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(3U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV8) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(3U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV8) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(3U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#else
  #if (STM32_MSIK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIK_ICSCR1_BITS          (RCC_ICSCR1_MSIKSEL_MSIRC1 |    \
                                             RCC_ICSCR1_MSIKDIV_FIELD(3U))
  #else
    #define STM32_MSIK_ICSCR1_BITS          0U
  #endif
#endif

