ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
/**
 * @brief   MSI kernel oscillator clock point.
 */
#if (STM32_MSIK_ENABLED == FALSE) && !defined(__DOXYGEN__)
  #define STM32_MSIK_FREQ                   0U
#elif ((STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV1) && \
      ((STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE) || (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE_FAST))) || \
    defined(__DOXYGEN__)
  #define STM32_MSIK_FREQ                   96010000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV1)
  #define STM32_MSIK_FREQ                   96000000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV2) && \
      ((STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE) || (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE_FAST))
  #define STM32_MSIK_FREQ                   48005000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV2)
  #define STM32_MSIK_FREQ                   48000000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV4) && \
      ((STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE) || (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE_FAST))
  #define STM32_MSIK_FREQ                   24002500U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV4)
  #define STM32_MSIK_FREQ                   24000000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV8) && \
      ((STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE) || (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE_FAST))
  #define STM32_MSIK_FREQ                   12001250U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV8)
  #define STM32_MSIK_FREQ                   12000000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1)) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #define STM32_MSIK_FREQ                   23986000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1)) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #define STM32_MSIK_FREQ                   24016000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #define STM32_MSIK_FREQ                   22577000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #define STM32_MSIK_FREQ                   22581000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #define STM32_MSIK_FREQ                   24576000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #define STM32_MSIK_FREQ                   24577000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1)
  #define STM32_MSIK_FREQ                   24000000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1)) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #define STM32_MSIK_FREQ                   11993000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1)) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #define STM32_MSIK_FREQ                   12008000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #define STM32_MSIK_FREQ                   11288500U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #define STM32_MSIK_FREQ                   11290500U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #define STM32_MSIK_FREQ                   12288000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #define STM32_MSIK_FREQ                   12288500U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2)
  #define STM32_MSIK_FREQ                   12000000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1)) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #define STM32_MSIK_FREQ                   5996500U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1)) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #define STM32_MSIK_FREQ                   6004000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #define STM32_MSIK_FREQ                   5644250U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #define STM32_MSIK_FREQ                   5645250U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #define STM32_MSIK_FREQ                   6144000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #define STM32_MSIK_FREQ                   6144250U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4)
  #define STM32_MSIK_FREQ                   6000000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV8) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1)) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #define STM32_MSIK_FREQ                   2998250U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV8) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1)) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #define STM32_MSIK_FREQ                   3002000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV8) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #define STM32_MSIK_FREQ                   2822125U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV8) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #define STM32_MSIK_FREQ                   2822625U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV8) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST))
  #define STM32_MSIK_FREQ                   3072000U
#elif (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV8) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3) && \
      ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) || (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST))
  #define STM32_MSIK_FREQ                   3072125U
#else
  #define STM32_MSIK_FREQ                   3000000U
#endif

/*--- Macros and checks for the SYSCLK clock point. ------------------------*/

/**
 * @brief   SYSCLK clock register bits.
 */
#if (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_MSIS) || defined(__DOXYGEN__)
  #define STM32_SYSCLK_BITS                 RCC_CFGR1_SW_MSIS
#elif (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_HSI16)
  #define STM32_SYSCLK_BITS                 RCC_CFGR1_SW_HSI16
#elif (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_HSE)
  #define STM32_SYSCLK_BITS                 RCC_CFGR1_SW_HSE
#else
  #error "invalid STM32_CFG_SYSCLK_SEL value specified"
#endif

/**
 * @brief   System clock clock point.
 */
#if ((STM32_SYSCLK_ENABLED == TRUE) && \
     (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_MSIS)) || \
    defined(__DOXYGEN__)
  #define STM32_SYSCLK_FREQ                 STM32_MSIS_FREQ
#elif (STM32_SYSCLK_ENABLED == TRUE) && \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_HSI16)
  #define STM32_SYSCLK_FREQ                 STM32_HSI16_FREQ
#elif (STM32_SYSCLK_ENABLED == TRUE) && \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_HSE)
  #define STM32_SYSCLK_FREQ                 STM32_HSE_FREQ
#else
  #define STM32_SYSCLK_FREQ                 0U
#endif

/*--- Macros and checks for the HCLK clock point. --------------------------*/

/**
 * @brief   HCLK clock register bits.
 */
#if (STM32_CFG_HCLK_VALUE == 1) || defined(__DOXYGEN__)
  #if (STM32_HCLK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_HCLK_BITS                 RCC_CFGR2_HPRE_DIV1
  #else
    #define STM32_HCLK_BITS                 0U
  #endif
#elif (STM32_CFG_HCLK_VALUE == 2)
  #if (STM32_HCLK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_HCLK_BITS                 RCC_CFGR2_HPRE_DIV2
  #else
    #define STM32_HCLK_BITS                 0U
  #endif
#elif (STM32_CFG_HCLK_VALUE == 4)
  #if (STM32_HCLK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_HCLK_BITS                 RCC_CFGR2_HPRE_DIV4
  #else
    #define STM32_HCLK_BITS                 0U
  #endif
#elif (STM32_CFG_HCLK_VALUE == 8)
  #if (STM32_HCLK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_HCLK_BITS                 RCC_CFGR2_HPRE_DIV8
  #else
    #define STM32_HCLK_BITS                 0U
  #endif
#elif (STM32_CFG_HCLK_VALUE == 16)
  #if (STM32_HCLK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_HCLK_BITS                 RCC_CFGR2_HPRE_DIV16
  #else
    #define STM32_HCLK_BITS                 0U
  #endif
#elif (STM32_CFG_HCLK_VALUE == 64)
  #if (STM32_HCLK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_HCLK_BITS                 RCC_CFGR2_HPRE_DIV64
  #else
    #define STM32_HCLK_BITS                 0U
  #endif
#elif (STM32_CFG_HCLK_VALUE == 128)
  #if (STM32_HCLK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_HCLK_BITS                 RCC_CFGR2_HPRE_DIV128
  #else
    #define STM32_HCLK_BITS                 0U
  #endif
#elif (STM32_CFG_HCLK_VALUE == 256)
  #if (STM32_HCLK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_HCLK_BITS                 RCC_CFGR2_HPRE_DIV256
  #else
    #define STM32_HCLK_BITS                 0U
  #endif
#elif (STM32_CFG_HCLK_VALUE == 512)
  #if (STM32_HCLK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_HCLK_BITS                 RCC_CFGR2_HPRE_DIV512
  #else
    #define STM32_HCLK_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_HCLK_VALUE value specified"
#endif

/**
 * @brief   AHB clock clock point.
 */
#if (STM32_HCLK_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HCLK_FREQ                   (STM32_SYSCLK_FREQ /            \
                                             STM32_CFG_HCLK_VALUE)
#else
  #define STM32_HCLK_FREQ                   0U
#endif

/*--- Macros and checks for the PCLK1 clock point. -------------------------*/

/**
 * @brief   PCLK1 clock register bits.
 */
#if (STM32_CFG_PCLK1_VALUE == 1) || defined(__DOXYGEN__)
  #if (STM32_PCLK1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK1_BITS                RCC_CFGR2_PPRE1_DIV1
  #else
    #define STM32_PCLK1_BITS                0U
  #endif
#elif (STM32_CFG_PCLK1_VALUE == 2)
  #if (STM32_PCLK1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK1_BITS                RCC_CFGR2_PPRE1_DIV2
  #else
    #define STM32_PCLK1_BITS                0U
  #endif
#elif (STM32_CFG_PCLK1_VALUE == 4)
  #if (STM32_PCLK1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK1_BITS                RCC_CFGR2_PPRE1_DIV4
  #else
    #define STM32_PCLK1_BITS                0U
  #endif
#elif (STM32_CFG_PCLK1_VALUE == 8)
  #if (STM32_PCLK1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK1_BITS                RCC_CFGR2_PPRE1_DIV8
  #else
    #define STM32_PCLK1_BITS                0U
  #endif
#elif (STM32_CFG_PCLK1_VALUE == 16)
  #if (STM32_PCLK1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK1_BITS                RCC_CFGR2_PPRE1_DIV16
  #else
    #define STM32_PCLK1_BITS                0U
  #endif
#else
  #error "invalid STM32_CFG_PCLK1_VALUE value specified"
#endif

/**
 * @brief   APB1 clock clock point.
 */
#if (STM32_PCLK1_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PCLK1_FREQ                  (STM32_HCLK_FREQ /              \
                                             STM32_CFG_PCLK1_VALUE)
#else
  #define STM32_PCLK1_FREQ                  0U
#endif

/*--- Macros and checks for the PCLK1TIM clock point. ----------------------*/

/**
 * @brief   PCLK1TIM clock register bits.
 */
#if (STM32_PCLK1TIM_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PCLK1TIM_BITS               0U
#else
  #define STM32_PCLK1TIM_BITS               0U
#endif

/**
 * @brief   APB1 timer clock clock point.
 */
#if (STM32_PCLK1TIM_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PCLK1TIM_FREQ               ((STM32_CFG_PCLK1_VALUE == 1) ? STM32_PCLK1_FREQ : \
                                             (STM32_PCLK1_FREQ * 2U))
#else
  #define STM32_PCLK1TIM_FREQ               0U
#endif

/*--- Macros and checks for the PCLK2 clock point. -------------------------*/

/**
 * @brief   PCLK2 clock register bits.
 */
#if (STM32_CFG_PCLK2_VALUE == 1) || defined(__DOXYGEN__)
  #if (STM32_PCLK2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK2_BITS                RCC_CFGR2_PPRE2_DIV1
  #else
    #define STM32_PCLK2_BITS                0U
  #endif
#elif (STM32_CFG_PCLK2_VALUE == 2)
  #if (STM32_PCLK2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK2_BITS                RCC_CFGR2_PPRE2_DIV2
  #else
    #define STM32_PCLK2_BITS                0U
  #endif
#elif (STM32_CFG_PCLK2_VALUE == 4)
  #if (STM32_PCLK2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK2_BITS                RCC_CFGR2_PPRE2_DIV4
  #else
    #define STM32_PCLK2_BITS                0U
  #endif
#elif (STM32_CFG_PCLK2_VALUE == 8)
  #if (STM32_PCLK2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK2_BITS                RCC_CFGR2_PPRE2_DIV8
  #else
    #define STM32_PCLK2_BITS                0U
  #endif
#elif (STM32_CFG_PCLK2_VALUE == 16)
  #if (STM32_PCLK2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK2_BITS                RCC_CFGR2_PPRE2_DIV16
  #else
    #define STM32_PCLK2_BITS                0U
  #endif
#else
  #error "invalid STM32_CFG_PCLK2_VALUE value specified"
#endif

/**
 * @brief   APB2 clock clock point.
 */
#if (STM32_PCLK2_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PCLK2_FREQ                  (STM32_HCLK_FREQ /              \
                                             STM32_CFG_PCLK2_VALUE)
#else
  #define STM32_PCLK2_FREQ                  0U
#endif

/*--- Macros and checks for the PCLK2TIM clock point. ----------------------*/

/**
 * @brief   PCLK2TIM clock register bits.
 */
#if (STM32_PCLK2TIM_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PCLK2TIM_BITS               0U
#else
  #define STM32_PCLK2TIM_BITS               0U
#endif

/**
 * @brief   APB2 timer clock clock point.
 */
#if (STM32_PCLK2TIM_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PCLK2TIM_FREQ               ((STM32_CFG_PCLK2_VALUE == 1) ? STM32_PCLK2_FREQ : \
                                             (STM32_PCLK2_FREQ * 2U))
#else
  #define STM32_PCLK2TIM_FREQ               0U
#endif

/*--- Macros and checks for the PCLK3 clock point. -------------------------*/

/**
 * @brief   PCLK3 clock register bits.
 */
#if (STM32_CFG_PCLK3_VALUE == 1) || defined(__DOXYGEN__)
  #if (STM32_PCLK3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK3_BITS                RCC_CFGR3_PPRE3_DIV1
  #else
    #define STM32_PCLK3_BITS                0U
  #endif
#elif (STM32_CFG_PCLK3_VALUE == 2)
  #if (STM32_PCLK3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK3_BITS                RCC_CFGR3_PPRE3_DIV2
  #else
    #define STM32_PCLK3_BITS                0U
  #endif
#elif (STM32_CFG_PCLK3_VALUE == 4)
  #if (STM32_PCLK3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK3_BITS                RCC_CFGR3_PPRE3_DIV4
  #else
    #define STM32_PCLK3_BITS                0U
  #endif
#elif (STM32_CFG_PCLK3_VALUE == 8)
  #if (STM32_PCLK3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK3_BITS                RCC_CFGR3_PPRE3_DIV8
  #else
    #define STM32_PCLK3_BITS                0U
  #endif
#elif (STM32_CFG_PCLK3_VALUE == 16)
  #if (STM32_PCLK3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK3_BITS                RCC_CFGR3_PPRE3_DIV16
  #else
    #define STM32_PCLK3_BITS                0U
  #endif
#else
  #error "invalid STM32_CFG_PCLK3_VALUE value specified"
#endif

/**
 * @brief   APB3 clock clock point.
 */
#if (STM32_PCLK3_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PCLK3_FREQ                  (STM32_HCLK_FREQ /              \
                                             STM32_CFG_PCLK3_VALUE)
#else
  #define STM32_PCLK3_FREQ                  0U
#endif

/*--- Macros and checks for the MCO1DIV clock point. -----------------------*/

/**
 * @brief   MCO1DIV clock register bits.
 */
#if (STM32_MCO1DIV_ENABLED == FALSE)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_OFF
#elif (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_OFF) || defined(__DOXYGEN__)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_OFF
#elif (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_SYSCLK)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_SYSCLK
#elif (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_MSIS)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_MSIS
#elif (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_HSI16)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_HSI16
#elif (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_HSE)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_HSE
#elif (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_LSI)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_LSI
#elif (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_LSE)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_LSE
#elif (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_HSI48)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_HSI48
#elif (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_MSIK)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_MSIK
#else
  #error "invalid STM32_CFG_MCO1DIV_SEL value specified"
#endif

/**
 * @brief   MCO1 selected source before prescaler clock point.
 */
#if ((STM32_MCO1DIV_ENABLED == TRUE) && \
     (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_OFF)) || \
    defined(__DOXYGEN__)
  #define STM32_MCO1DIV_FREQ                STM32_NONE_FREQ
#elif (STM32_MCO1DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_SYSCLK)
  #define STM32_MCO1DIV_FREQ                STM32_SYSCLK_FREQ
#elif (STM32_MCO1DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_MSIS)
  #define STM32_MCO1DIV_FREQ                STM32_MSIS_FREQ
#elif (STM32_MCO1DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_HSI16)
  #define STM32_MCO1DIV_FREQ                STM32_HSI16_FREQ
#elif (STM32_MCO1DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_HSE)
  #define STM32_MCO1DIV_FREQ                STM32_HSE_FREQ
#elif (STM32_MCO1DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_LSI)
  #define STM32_MCO1DIV_FREQ                STM32_LSI_FREQ
#elif (STM32_MCO1DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_LSE)
  #define STM32_MCO1DIV_FREQ                STM32_LSE_FREQ
#elif (STM32_MCO1DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_HSI48)
  #define STM32_MCO1DIV_FREQ                STM32_HSI48_FREQ
#elif (STM32_MCO1DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_MSIK)
  #define STM32_MCO1DIV_FREQ                STM32_MSIK_FREQ
#else
  #define STM32_MCO1DIV_FREQ                0U
#endif

/*--- Macros and checks for the MCO1 clock point. --------------------------*/

/**
 * @brief   MCO1 clock register bits.
 */
#if (STM32_CFG_MCO1_VALUE == 1) || defined(__DOXYGEN__)
  #if (STM32_MCO1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO1_BITS                 RCC_CFGR1_MCO1PRE_DIV1
  #else
    #define STM32_MCO1_BITS                 0U
  #endif
#elif (STM32_CFG_MCO1_VALUE == 2)
  #if (STM32_MCO1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO1_BITS                 RCC_CFGR1_MCO1PRE_DIV2
  #else
    #define STM32_MCO1_BITS                 0U
  #endif
#elif (STM32_CFG_MCO1_VALUE == 4)
  #if (STM32_MCO1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO1_BITS                 RCC_CFGR1_MCO1PRE_DIV4
  #else
    #define STM32_MCO1_BITS                 0U
  #endif
#elif (STM32_CFG_MCO1_VALUE == 8)
  #if (STM32_MCO1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO1_BITS                 RCC_CFGR1_MCO1PRE_DIV8
  #else
    #define STM32_MCO1_BITS                 0U
  #endif
#elif (STM32_CFG_MCO1_VALUE == 16)
  #if (STM32_MCO1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO1_BITS                 RCC_CFGR1_MCO1PRE_DIV16
  #else
    #define STM32_MCO1_BITS                 0U
  #endif
#elif (STM32_CFG_MCO1_VALUE == 32)
  #if (STM32_MCO1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO1_BITS                 RCC_CFGR1_MCO1PRE_DIV32
  #else
    #define STM32_MCO1_BITS                 0U
  #endif
#elif (STM32_CFG_MCO1_VALUE == 64)
  #if (STM32_MCO1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO1_BITS                 RCC_CFGR1_MCO1PRE_DIV64
  #else
    #define STM32_MCO1_BITS                 0U
  #endif
#elif (STM32_CFG_MCO1_VALUE == 128)
  #if (STM32_MCO1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO1_BITS                 RCC_CFGR1_MCO1PRE_DIV128
  #else
    #define STM32_MCO1_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_MCO1_VALUE value specified"
#endif

/**
 * @brief   MCO1 output pin clock point.
 */
#if (STM32_MCO1_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_MCO1_FREQ                   (STM32_MCO1DIV_FREQ /           \
                                             STM32_CFG_MCO1_VALUE)
#else
  #define STM32_MCO1_FREQ                   0U
#endif

