ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
/*--- Macros and checks for the MCO2DIV clock point. -----------------------*/

/**
 * @brief   MCO2DIV clock register bits.
 */
#if (STM32_MCO2DIV_ENABLED == FALSE)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_OFF
#elif (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_OFF) || defined(__DOXYGEN__)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_OFF
#elif (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_SYSCLK)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_SYSCLK
#elif (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_MSIS)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_MSIS
#elif (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_HSI16)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_HSI16
#elif (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_HSE)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_HSE
#elif (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_LSI)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_LSI
#elif (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_LSE)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_LSE
#elif (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_HSI48)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_HSI48
#elif (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_MSIK)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_MSIK
#else
  #error "invalid STM32_CFG_MCO2DIV_SEL value specified"
#endif

/**
 * @brief   MCO2 selected source before prescaler clock point.
 */
#if ((STM32_MCO2DIV_ENABLED == TRUE) && \
     (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_OFF)) || \
    defined(__DOXYGEN__)
  #define STM32_MCO2DIV_FREQ                STM32_NONE_FREQ
#elif (STM32_MCO2DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_SYSCLK)
  #define STM32_MCO2DIV_FREQ                STM32_SYSCLK_FREQ
#elif (STM32_MCO2DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_MSIS)
  #define STM32_MCO2DIV_FREQ                STM32_MSIS_FREQ
#elif (STM32_MCO2DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_HSI16)
  #define STM32_MCO2DIV_FREQ                STM32_HSI16_FREQ
#elif (STM32_MCO2DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_HSE)
  #define STM32_MCO2DIV_FREQ                STM32_HSE_FREQ
#elif (STM32_MCO2DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_LSI)
  #define STM32_MCO2DIV_FREQ                STM32_LSI_FREQ
#elif (STM32_MCO2DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_LSE)
  #define STM32_MCO2DIV_FREQ                STM32_LSE_FREQ
#elif (STM32_MCO2DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_HSI48)
  #define STM32_MCO2DIV_FREQ                STM32_HSI48_FREQ
#elif (STM32_MCO2DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_MSIK)
  #define STM32_MCO2DIV_FREQ                STM32_MSIK_FREQ
#else
  #define STM32_MCO2DIV_FREQ                0U
#endif

/*--- Macros and checks for the MCO2 clock point. --------------------------*/

/**
 * @brief   MCO2 clock register bits.
 */
#if (STM32_CFG_MCO2_VALUE == 1) || defined(__DOXYGEN__)
  #if (STM32_MCO2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO2_BITS                 RCC_CFGR1_MCO2PRE_DIV1
  #else
    #define STM32_MCO2_BITS                 0U
  #endif
#elif (STM32_CFG_MCO2_VALUE == 2)
  #if (STM32_MCO2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO2_BITS                 RCC_CFGR1_MCO2PRE_DIV2
  #else
    #define STM32_MCO2_BITS                 0U
  #endif
#elif (STM32_CFG_MCO2_VALUE == 4)
  #if (STM32_MCO2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO2_BITS                 RCC_CFGR1_MCO2PRE_DIV4
  #else
    #define STM32_MCO2_BITS                 0U
  #endif
#elif (STM32_CFG_MCO2_VALUE == 8)
  #if (STM32_MCO2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO2_BITS                 RCC_CFGR1_MCO2PRE_DIV8
  #else
    #define STM32_MCO2_BITS                 0U
  #endif
#elif (STM32_CFG_MCO2_VALUE == 16)
  #if (STM32_MCO2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO2_BITS                 RCC_CFGR1_MCO2PRE_DIV16
  #else
    #define STM32_MCO2_BITS                 0U
  #endif
#elif (STM32_CFG_MCO2_VALUE == 32)
  #if (STM32_MCO2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO2_BITS                 RCC_CFGR1_MCO2PRE_DIV32
  #else
    #define STM32_MCO2_BITS                 0U
  #endif
#elif (STM32_CFG_MCO2_VALUE == 64)
  #if (STM32_MCO2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO2_BITS                 RCC_CFGR1_MCO2PRE_DIV64
  #else
    #define STM32_MCO2_BITS                 0U
  #endif
#elif (STM32_CFG_MCO2_VALUE == 128)
  #if (STM32_MCO2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO2_BITS                 RCC_CFGR1_MCO2PRE_DIV128
  #else
    #define STM32_MCO2_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_MCO2_VALUE value specified"
#endif

/**
 * @brief   MCO2 output pin clock point.
 */
#if (STM32_MCO2_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_MCO2_FREQ                   (STM32_MCO2DIV_FREQ /           \
                                             STM32_CFG_MCO2_VALUE)
#else
  #define STM32_MCO2_FREQ                   0U
#endif
/** @} */

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/**
 * @brief   Returns the frequency of a clock point in Hz.
 * @note    Static implementation.
 *
 * @param[in] clkpt     clock point to be returned
 * @return              The clock point frequency in Hz or zero if the
 *                      frequency is unknown.
 *
 * @notapi
 */
#if (STM32_CFG_CLOCK_DYNAMIC == FALSE) || defined(__DOXYGEN__)
#define hal_lld_get_clock_point(clkpt)                                      \
  ((clkpt) == CLK_HSI16        ? STM32_HSI16_FREQ         :                       \
   (clkpt) == CLK_HSI48        ? STM32_HSI48_FREQ         :                       \
   (clkpt) == CLK_HSE          ? STM32_HSE_FREQ           :                       \
   (clkpt) == CLK_MSIS         ? STM32_MSIS_FREQ          :                       \
   (clkpt) == CLK_MSIK         ? STM32_MSIK_FREQ          :                       \
   (clkpt) == CLK_SYSCLK       ? STM32_SYSCLK_FREQ        :                       \
   (clkpt) == CLK_HCLK         ? STM32_HCLK_FREQ          :                       \
   (clkpt) == CLK_PCLK1        ? STM32_PCLK1_FREQ         :                       \
   (clkpt) == CLK_PCLK1TIM     ? STM32_PCLK1TIM_FREQ      :                       \
   (clkpt) == CLK_PCLK2        ? STM32_PCLK2_FREQ         :                       \
   (clkpt) == CLK_PCLK2TIM     ? STM32_PCLK2TIM_FREQ      :                       \
   (clkpt) == CLK_PCLK3        ? STM32_PCLK3_FREQ         :                       \
   (clkpt) == CLK_MCO1         ? STM32_MCO1_FREQ          :                       \
   (clkpt) == CLK_MCO2         ? STM32_MCO2_FREQ          :                       \
   0U)
#endif

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

#ifdef __cplusplus
extern "C" {
#endif
#ifdef __cplusplus
}
#endif

#endif /* CLOCKTREE_H */

/** @} */
